In [462]:
# Importing required libraries

import pandas as pd
import numpy as np

In [463]:
# Creating dataset for practicing Pandas

data = {
    "OrderID": [
        1001, 1002, 1003, 1004, 1005,
        1006, 1007, 1008, 1009, 1010,
        1011, 1012, 1013, 1014, 1015,
        1016, 1017, 1018, 1019, 1020
    ],
    
    "Customer": [
        "Alice", "Bob", "Charlie", "Diana", "Emma",
        "Frank", "George", "Helen", "Ian", "Jenny",
        "Kyle", "Laura", "Mike", "Nina", "Oscar",
        "Paul", "Queen", "Rita", "Sam", "Tina"
    ],
    
    # Mixed date formats to test pd.to_datetime parsing
    "OrderDate": [
        "2023-01-05", "05/02/2023", "2023/03/12", "12-04-2023", "2023-05-01",
        "2023-06-15", "15/07/2023", "2023/08/20", "20-09-2023", "2023-10-11",
        "2023-11-01", "01/12/2023", "2024/01/05", "05-02-2024", "2024-03-15",
        "2024-04-18", "18/05/2024", "2024/06/22", "22-07-2024", None
    ],
    
    # Category column for grouping, value_counts, plots
    "Category": [
        "A", "B", "A", "C", "B",
        "A", "C", "B", "C", "A",
        "B", "C", "A", "B", "C",
        "A", "A", "C", "B", "C"
    ],
    
    # Price as string with commas for cleaning exercises
    "UnitPrice": [
        "1,200.50", "500", "750.25", "1,000", "650.00",
        "900", "1,500", "450", "1,050.75", "800",
        "999.99", "1,700", "880.40", "1,250", "600",
        "1,300", "550", "700", "1,450", "1,100"
    ],
    
    # Quantity column for numeric operations
    "Quantity": [
        2, 1, 3, 5, 2,
        4, 1, 2, 3, 5,
        2, 4, 3, 1, 2,
        5, 6, 1, 2, 3
    ],
    
    # Email column for string functions: .str.split, .str.contains, .str.lower, etc.
    "Email": [
        "alice@example.com", "bob@mail.com", "charlie@example.com", "diana@mail.com", "emma@example.com",
        "frank@mail.com", "george@example.com", "helen@mail.com", "ian@mail.com", "jenny@example.com",
        "kyle@mail.com", "laura@example.com", "mike@mail.com", "nina@example.com", "oscar@mail.com",
        "paul@example.com", "queen@mail.com", "rita@example.com", "sam@mail.com", "tina@example.com"
    ],
    
    # Status column for filtering, replace(), category analysis
    "Status": [
        "Delivered", "Pending", "Delivered", "Returned", "Delivered",
        "Pending", "Delivered", "Pending", "Delivered", "Delivered",
        "Returned", "Pending", "Delivered", "Pending", "Delivered",
        "Delivered", "Pending", "Returned", "Pending", "Delivered"
    ],
    
    # Float column with some NaN values for mean(), fillna(), interpolate()
    "Rating": [
        4.5, 3.8, None, 4.2, 5.0,
        None, 3.5, 4.8, 4.0, None,
        3.9, 4.4, None, 5.0, 4.7,
        4.1, None, 3.6, 4.9, 4.3
    ],
    
    # Random sales numbers for sorting, plotting, stats
    "Sales": [
        2400, 500, 2250, 5000, 1300,
        3600, 1500, 900, 3150, 4000,
        1999, 6800, 2641, 1250, 2800,
        3900, 3300, 700, 2900, 2200
    ],
}

### A

In [464]:
df = pd.DataFrame(data)
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [465]:
df.tail()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
15,1016,Paul,2024-04-18,A,"1,300",5,paul@example.com,Delivered,4.1,3900
16,1017,Queen,18/05/2024,A,550,6,queen@mail.com,Pending,NaN,3300
17,1018,Rita,2024/06/22,C,700,1,rita@example.com,Returned,3.6,700
18,1019,Sam,22-07-2024,B,"1,450",2,sam@mail.com,Pending,4.9,2900
19,1020,Tina,None,C,"1,100",3,tina@example.com,Delivered,4.3,2200

In [466]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OrderID    20 non-null     int64
 1   Customer   20 non-null     object
 2   OrderDate  19 non-null     object
 3   Category   20 non-null     object
 4   UnitPrice  20 non-null     object
 5   Quantity   20 non-null     int64
 6   Email      20 non-null     object
 7   Status     20 non-null     object
 8   Rating     15 non-null     float64
 9   Sales      20 non-null     int64
dtypes: float64(1), int64(3), object(6)
memory usage: 1.7+ KB

In [467]:
df.describe()

          OrderID   Quantity     Rating        Sales
count    20.00000  20.000000  15.000000    20.000000
mean   1010.50000   2.850000   4.313333  2654.500000
std       5.91608   1.531253   0.498378  1542.912096
min    1001.00000   1.000000   3.500000   500.000000
25%    1005.75000   2.000000   3.950000  1450.000000
50%    1010.50000   2.500000   4.300000  2520.500000
75%    1015.25000   4.000000   4.750000  3375.000000
max    1020.00000   6.000000   5.000000  6800.000000

In [468]:
print(df.shape)
print()

print(df.columns)
print()

print(df.index)
print()

print(df.dtypes)
print()

(20, 10)

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

RangeIndex(start=0, stop=20, step=1)

OrderID        int64
Customer      object
OrderDate     object
Category      object
UnitPrice     object
Quantity       int64
Email         object
Status        object
Rating       float64
Sales          int64
dtype: object

In [469]:
print(df['OrderID'])
print()
print(df[['OrderID', 'Sales']])

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
Name: OrderID, dtype: int64

    OrderID  Sales
0      1001   2400
1      1002    500
2      1003   2250
3      1004   5000
4      1005   1300
5      1006   3600
6      1007   1500
7      1008    900
8      1009   3150
9      1010   4000
10     1011   1999
11     1012   6800
12     1013   2641
13     1014   1250
14     1015   2800
15     1016   3900
16     1017   3300
17     1018    700
18     1019   2900
19     1020   2200

In [470]:
print(df.iloc[0])

OrderID                   1001
Customer                 Alice
OrderDate           2023-01-05
Category                     A
UnitPrice             1,200.50
Quantity                     2
Email        alice@example.com
Status               Delivered
Rating                     4.5
Sales                     2400
Name: 0, dtype: object

In [471]:
print(df[df['Rating']>4.8])

    OrderID Customer   OrderDate Category UnitPrice  Quantity  \
4      1005     Emma  2023-05-01        B    650.00         2
13     1014     Nina  05-02-2024        B     1,250         1
18     1019      Sam  22-07-2024        B     1,450         2

               Email     Status  Rating  Sales
4   emma@example.com  Delivered     5.0   1300
13  nina@example.com    Pending     5.0   1250
18      sam@mail.com    Pending     4.9   2900

In [472]:
df.columns

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

In [473]:
df['Category'].value_counts()

Category
A    7
C    7
B    6
Name: count, dtype: int64

In [474]:
df[['Category', 'Status']].value_counts()

Category  Status
A         Delivered    5
B         Pending      4
C         Delivered    4
A         Pending      2
C         Returned     2
B         Delivered    1
          Returned     1
C         Pending      1
Name: count, dtype: int64

In [475]:
df['UnitPrice'].sort_values()

3        1,000
8     1,050.75
19       1,100
0     1,200.50
13       1,250
15       1,300
18       1,450
6        1,500
11       1,700
7          450
1          500
16         550
14         600
4       650.00
17         700
2       750.25
9          800
12      880.40
5          900
10      999.99
Name: UnitPrice, dtype: object

In [476]:
df.rename(columns={'Status': 'Status'})

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300
5,1006,Frank,2023-06-15,A,900,4,frank@mail.com,Pending,NaN,3600
6,1007,George,15/07/2023,C,"1,500",1,george@example.com,Delivered,3.5,1500
7,1008,Helen,2023/08/20,B,450,2,helen@mail.com,Pending,4.8,900
8,1009,Ian,20-09-2023,C,"1,050.75",3,ian@mail.com,Delivered,4.0,3150
9,1010,Jenny,2023-10-11,A,800,5,jenny@example.com,Delivered,NaN,4000
10,1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999
11,1012,Laura,01/12/2023,C,"1,700",4,laura@example.com,Pending,4.4,6800
12,1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641
13,1014,Nina,05-02-2024,B,"1,250",1,nina@example.com,Pending,5.0,1250
14,1015,Oscar,2024-03-15,C,600,2,oscar@mail.com,Delivered,4.7,2800
15,1016,Paul,2024-04-18,A,"1,300",5,paul@example.com,Delivered,4.1,3900
16,1017,Queen,18/05/2024,A,550,6,queen@mail.com,Pending,NaN,3300
17,1018,Rita,2024/06/22,C,700,1,rita@example.com,Returned,3.6,700
18,1019,Sam,22-07-2024,B,"1,450",2,sam@mail.com,Pending,4.9,2900
19,1020,Tina,None,C,"1,100",3,tina@example.com,Delivered,4.3,2200

====================================================================

### B

In [477]:
df.columns

Index(['OrderID', 'Customer', 'OrderDate', 'Category', 'UnitPrice', 'Quantity',
       'Email', 'Status', 'Rating', 'Sales'],
      dtype='object')

In [478]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [479]:
series1 = pd.Series(df['OrderID'])
print(series1)

0     1001
1     1002
2     1003
3     1004
4     1005
5     1006
6     1007
7     1008
8     1009
9     1010
10    1011
11    1012
12    1013
13    1014
14    1015
15    1016
16    1017
17    1018
18    1019
19    1020
Name: OrderID, dtype: int64

In [480]:
series2 = pd.Series(df['Rating'])
print(series2)

0     4.5
1     3.8
2     NaN
3     4.2
4     5.0
5     NaN
6     3.5
7     4.8
8     4.0
9     NaN
10    3.9
11    4.4
12    NaN
13    5.0
14    4.7
15    4.1
16    NaN
17    3.6
18    4.9
19    4.3
Name: Rating, dtype: float64

In [481]:
series1.cov(series2)

np.float64(0.28952380952380957)

====================================================================

In [482]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales
0,1001,Alice,2023-01-05,A,"1,200.50",2,alice@example.com,Delivered,4.5,2400
1,1002,Bob,05/02/2023,B,500,1,bob@mail.com,Pending,3.8,500
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250
3,1004,Diana,12-04-2023,C,"1,000",5,diana@mail.com,Returned,4.2,5000
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300

In [483]:
df['UnitPrice'] = df['UnitPrice'].str.replace(',','').astype(float)

In [484]:
df['IsAbove1K'] = df['UnitPrice'] >= 1000

In [485]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,IsAbove1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [486]:
df['IsAbove2K'] = df['UnitPrice'] >= 2000

In [487]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,IsAbove1K,IsAbove2K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,False
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,False
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,False

In [488]:
df.drop(columns=['IsAbove2K'], inplace=True)

In [489]:
df.rename(columns={'IsAbove1K':'Above1K'}, inplace=True)

In [490]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [491]:
df.drop(index=19)

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False
5,1006,Frank,2023-06-15,A,900.00,4,frank@mail.com,Pending,NaN,3600,False
6,1007,George,15/07/2023,C,1500.00,1,george@example.com,Delivered,3.5,1500,True
7,1008,Helen,2023/08/20,B,450.00,2,helen@mail.com,Pending,4.8,900,False
8,1009,Ian,20-09-2023,C,1050.75,3,ian@mail.com,Delivered,4.0,3150,True
9,1010,Jenny,2023-10-11,A,800.00,5,jenny@example.com,Delivered,NaN,4000,False
10,1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999,False
11,1012,Laura,01/12/2023,C,1700.00,4,laura@example.com,Pending,4.4,6800,True
12,1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641,False
13,1014,Nina,05-02-2024,B,1250.00,1,nina@example.com,Pending,5.0,1250,True
14,1015,Oscar,2024-03-15,C,600.00,2,oscar@mail.com,Delivered,4.7,2800,False
15,1016,Paul,2024-04-18,A,1300.00,5,paul@example.com,Delivered,4.1,3900,True
16,1017,Queen,18/05/2024,A,550.00,6,queen@mail.com,Pending,NaN,3300,False
17,1018,Rita,2024/06/22,C,700.00,1,rita@example.com,Returned,3.6,700,False
18,1019,Sam,22-07-2024,B,1450.00,2,sam@mail.com,Pending,4.9,2900,True

In [492]:
df.set_index('OrderID')

,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
OrderID,,,,,,,,,,
1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False
1006,Frank,2023-06-15,A,900.00,4,frank@mail.com,Pending,NaN,3600,False
1007,George,15/07/2023,C,1500.00,1,george@example.com,Delivered,3.5,1500,True
1008,Helen,2023/08/20,B,450.00,2,helen@mail.com,Pending,4.8,900,False
1009,Ian,20-09-2023,C,1050.75,3,ian@mail.com,Delivered,4.0,3150,True
1010,Jenny,2023-10-11,A,800.00,5,jenny@example.com,Delivered,NaN,4000,False
1011,Kyle,2023-11-01,B,999.99,2,kyle@mail.com,Returned,3.9,1999,False
1012,Laura,01/12/2023,C,1700.00,4,laura@example.com,Pending,4.4,6800,True
1013,Mike,2024/01/05,A,880.40,3,mike@mail.com,Delivered,NaN,2641,False
1014,Nina,05-02-2024,B,1250.00,1,nina@example.com,Pending,5.0,1250,True
1015,Oscar,2024-03-15,C,600.00,2,oscar@mail.com,Delivered,4.7,2800,False
1016,Paul,2024-04-18,A,1300.00,5,paul@example.com,Delivered,4.1,3900,True
1017,Queen,18/05/2024,A,550.00,6,queen@mail.com,Pending,NaN,3300,False
1018,Rita,2024/06/22,C,700.00,1,rita@example.com,Returned,3.6,700,False
1019,Sam,22-07-2024,B,1450.00,2,sam@mail.com,Pending,4.9,2900,True
1020,Tina,None,C,1100.00,3,tina@example.com,Delivered,4.3,2200,True

In [493]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [494]:
df.loc[2:5,['OrderID', 'UnitPrice']]

   OrderID  UnitPrice
2     1003     750.25
3     1004    1000.00
4     1005     650.00
5     1006     900.00

In [495]:
df.loc[2:5,'OrderID': 'UnitPrice']

   OrderID Customer   OrderDate Category  UnitPrice
2     1003  Charlie  2023/03/12        A     750.25
3     1004    Diana  12-04-2023        C    1000.00
4     1005     Emma  2023-05-01        B     650.00
5     1006    Frank  2023-06-15        A     900.00

In [496]:
df.iloc[2:5, 0:2]

   OrderID Customer
2     1003  Charlie
3     1004    Diana
4     1005     Emma

In [497]:
df.iloc[0]

OrderID                   1001
Customer                 Alice
OrderDate           2023-01-05
Category                     A
UnitPrice               1200.5
Quantity                     2
Email        alice@example.com
Status               Delivered
Rating                     4.5
Sales                     2400
Above1K                   True
Name: 0, dtype: object

In [498]:
series3 = pd.Series(df['Customer'])
series3.head()

0      Alice
1        Bob
2    Charlie
3      Diana
4       Emma
Name: Customer, dtype: object

In [499]:
print(series3.str.upper())

0       ALICE
1         BOB
2     CHARLIE
3       DIANA
4        EMMA
5       FRANK
6      GEORGE
7       HELEN
8         IAN
9       JENNY
10       KYLE
11      LAURA
12       MIKE
13       NINA
14      OSCAR
15       PAUL
16      QUEEN
17       RITA
18        SAM
19       TINA
Name: Customer, dtype: object

In [500]:
print(series3.str.slice(2,5))

0     ice
1       b
2     arl
3     ana
4      ma
5     ank
6     org
7     len
8       n
9     nny
10     le
11    ura
12     ke
13     na
14    car
15     ul
16    een
17     ta
18      m
19     na
Name: Customer, dtype: object

In [501]:
print(series3.str.replace('A','Z',regex=True))

0       Zlice
1         Bob
2     Charlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

In [502]:
print(series3.str.replace('A|B','Z', regex=True))

0       Zlice
1         Zob
2     Charlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

In [503]:
series3.replace({'A': 'Z', 'B': 'Y', 'C': 'X'}, regex=True)

0       Zlice
1         Yob
2     Xharlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

In [504]:
print(df['Customer'].str.replace("A|B","Z", regex=True))

0       Zlice
1         Zob
2     Charlie
3       Diana
4        Emma
5       Frank
6      George
7       Helen
8         Ian
9       Jenny
10       Kyle
11      Laura
12       Mike
13       Nina
14      Oscar
15       Paul
16      Queen
17       Rita
18        Sam
19       Tina
Name: Customer, dtype: object

====================================================================

### C

In [505]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False

In [506]:
def TotalCost(row):
    return row['UnitPrice'] * row['Quantity']

In [507]:
df['TotalCost'] = df.apply(TotalCost, axis = 1)

df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00

In [508]:
df['SqureRootCost'] = df['TotalCost'].apply(np.sqrt)

In [509]:
df.head()

,OrderID,Customer,OrderDate,Category,UnitPrice,Quantity,Email,Status,Rating,Sales,Above1K,TotalCost,SqureRootCost
0,1001,Alice,2023-01-05,A,1200.50,2,alice@example.com,Delivered,4.5,2400,True,2401.00,49.000000
1,1002,Bob,05/02/2023,B,500.00,1,bob@mail.com,Pending,3.8,500,False,500.00,22.360680
2,1003,Charlie,2023/03/12,A,750.25,3,charlie@example.com,Delivered,NaN,2250,False,2250.75,47.442070
3,1004,Diana,12-04-2023,C,1000.00,5,diana@mail.com,Returned,4.2,5000,True,5000.00,70.710678
4,1005,Emma,2023-05-01,B,650.00,2,emma@example.com,Delivered,5.0,1300,False,1300.00,36.055513

In [510]:
df['TotalCost'].values

array([2401.  ,  500.  , 2250.75, 5000.  , 1300.  , 3600.  , 1500.  ,
        900.  , 3152.25, 4000.  , 1999.98, 6800.  , 2641.2 , 1250.  ,
       1200.  , 6500.  , 3300.  ,  700.  , 2900.  , 3300.  ])

In [512]:
print(np.sum(df['TotalCost'].values))

55195.18